#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/agent-config.yaml"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "1539" -> (known after apply)
      ~ content_md5                = "gvBq6p+5LGrhk1mrk0MGJw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Fagent-config.yaml" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/agent-config.yaml 2026-02-02 00:04:08.621307451 +0000 UTC" -> "./../os-config/infisical-config/agent-config.yaml 2026-02-02 00:05:29.077678833 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "1e94a2ec-4ad3-48d3-b250-dee7b0f0951b" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/freshrss.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "138" -> (known after apply)
      ~ content_md5                = "2lVZJ2WbOYM+bd/69gdCWA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Ffreshrss.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/freshrss.env.tmpl 2026-02-02 00:04:08.621307451 +0000 UTC" -> "./../os-config/infisical-config/templates/freshrss.env.tmpl 2026-02-02 00:05:29.077678833 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "7377d6b3-3acb-4d08-8811-515c4cb6258a" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/fulltextrss-config.php.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "606" -> (known after apply)
      ~ content_md5                = "nJGwExTlLFCnNOCEuIoq9A==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Ffulltextrss-config.php.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/fulltextrss-config.php.tmpl 2026-02-02 00:04:08.621307451 +0000 UTC" -> "./../os-config/infisical-config/templates/fulltextrss-config.php.tmpl 2026-02-02 00:05:29.077678833 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "5c0d2a0f-06d9-46c4-b754-49be03aa9af9" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/ghcr-token.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "159" -> (known after apply)
      ~ content_md5                = "8dhlkgEsl0yAr60rjy+txA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fghcr-token.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/ghcr-token.tmpl 2026-02-02 00:04:08.621307451 +0000 UTC" -> "./../os-config/infisical-config/templates/ghcr-token.tmpl 2026-02-02 00:05:29.077678833 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "020e496c-64d1-4d44-bc79-c349c79ae024" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter-config.conf.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "823" -> (known after apply)
      ~ content_md5                = "9Qdx22F1wRqMU4aBsI31iQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter-config.conf.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter-config.conf.tmpl 2026-02-02 00:04:08.621307451 +0000 UTC" -> "./../os-config/infisical-config/templates/nitter-config.conf.tmpl 2026-02-02 00:05:29.077678833 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "1e3418c4-73c4-4969-8058-273f09b91011" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter-sessions.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "134" -> (known after apply)
      ~ content_md5                = "mDL4ycY76BaAptRpg0tdWg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter-sessions.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter-sessions.tmpl 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/infisical-config/templates/nitter-sessions.tmpl 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "526af6cc-debe-4055-9ab0-f7c698df2bc0" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "dqew4r9hLjCgmZM0Ent8IA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter.env.tmpl 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/infisical-config/templates/nitter.env.tmpl 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "7fe820fb-aa7a-40b7-8182-1fb603df3bdd" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/planka-postgres.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "145" -> (known after apply)
      ~ content_md5                = "UuBhrWt6vw/DS8rRmijDpw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fplanka-postgres.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/planka-postgres.env.tmpl 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/infisical-config/templates/planka-postgres.env.tmpl 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "02a3d1b6-c5a9-4e7a-9a0d-acbe8bb2dd3b" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/planka.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "UoV1pgPnJd9zAa/VSjVsug==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fplanka.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/planka.env.tmpl 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/infisical-config/templates/planka.env.tmpl 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "5eee48c4-85f2-4ef8-97a6-007ea32be262" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/redlib.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "BQch5XB0PknGP/8l2GKw8w==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fredlib.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/redlib.env.tmpl 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/infisical-config/templates/redlib.env.tmpl 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "9ff29d6e-6c61-4321-a7ba-214c32fc060c" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/autorestic-backup.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "824" -> (known after apply)
      ~ content_md5                = "HRhu6dPvDUR11JG6/QxYoQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Fautorestic-backup.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/autorestic-backup.container 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/quadlets/autorestic-backup.container 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "cd178c1c-e235-4b82-b868-b56887db0a67" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/autorestic-restore.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "1159" -> (known after apply)
      ~ content_md5                = "RRApOVHlX+AcJtnKwWdeYA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Fautorestic-restore.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/autorestic-restore.container 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/quadlets/autorestic-restore.container 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "0822d9b0-4064-4396-8405-07872662a70b" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/infisical-agent.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "643" -> (known after apply)
      ~ content_md5                = "rbNV/YwXJEJ98Ah6innH3g==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Finfisical-agent.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/infisical-agent.container 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/quadlets/infisical-agent.container 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "6861f47d-627d-4e50-bbe1-b951343fcc5f" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/traefik.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "441" -> (known after apply)
      ~ content_md5                = "liTv9S0p/ZpRNFG6/hDddQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Ftraefik.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/traefik.container 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/quadlets/traefik.container 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "a367c150-2c5d-44d6-8108-b247bb609756" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-backup-wrapper.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "493" -> (known after apply)
      ~ content_md5                = "zs/BL6xGQX7UB8jI5tH9Zw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-backup-wrapper.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-backup-wrapper.service 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/app-backup-wrapper.service 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "ecb96e86-8e5b-4fd9-99c3-0f9d4b0eb081" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-backup.timer"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "179" -> (known after apply)
      ~ content_md5                = "fGvbbPWuCkC5I2HxzpD7cg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-backup.timer" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-backup.timer 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/app-backup.timer 2026-02-02 00:05:29.078678822 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "e827f1ca-e59e-497f-9ac6-9af274153eb6" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-restart@.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "119" -> (known after apply)
      ~ content_md5                = "gsf5zYqlcPhQM1f3s6ImNg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-restart@.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-restart@.service 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/app-restart@.service 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "d5c63e05-ff39-4b36-a00e-81f266379ac3" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/freshrss.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "203" -> (known after apply)
      ~ content_md5                = "sQrUNOXfCCwmi+Y3p0VN0A==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Ffreshrss.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/freshrss.path 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/freshrss.path 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "86d46887-1505-4e7e-8a12-e035196f280f" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/freshrss.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "462" -> (known after apply)
      ~ content_md5                = "bkVxDFjaj6wDaHp3v3QCKA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Ffreshrss.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/freshrss.service 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/freshrss.service 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "47221a69-15c9-4097-aee2-1c89b909583c" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/ghcr-login.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "333" -> (known after apply)
      ~ content_md5                = "3DoYQr7BhzU3ZJzbrUnNEw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fghcr-login.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/ghcr-login.service 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/ghcr-login.service 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "878689d4-a2ad-4adf-89c1-ed679bc6e004" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/gitops-sync.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "193" -> (known after apply)
      ~ content_md5                = "rjkWfNVqAvnTLiaWl7hnJA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fgitops-sync.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/gitops-sync.service 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/gitops-sync.service 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "1006e742-2f47-4ad9-b05e-a8d63c6ff4ab" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/gitops-sync.timer"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "116" -> (known after apply)
      ~ content_md5                = "AM0Wi3K0wtCLJHuxwySDRQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fgitops-sync.timer" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/gitops-sync.timer 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/gitops-sync.timer 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "fe5860ad-2aed-4407-94ac-e11394db23e2" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/nitter.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "243" -> (known after apply)
      ~ content_md5                = "lscA8O+eZvgiXR3gP/Btgg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fnitter.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/nitter.path 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/nitter.path 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "c1ea9b79-4892-4601-89dd-2b970ec191bc" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/nitter.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "402" -> (known after apply)
      ~ content_md5                = "+7KApK1BrAqJvpX/B/XZiw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fnitter.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/nitter.service 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/nitter.service 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "3aedd73d-e3f1-4d23-849b-684b8fb2ba76" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/planka.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "241" -> (known after apply)
      ~ content_md5                = "UbkGbkBS2oYM6GajhXBxMQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fplanka.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/planka.path 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/planka.path 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "6549d869-49c8-4c5b-933b-ff6b74893ae2" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/planka.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "460" -> (known after apply)
      ~ content_md5                = "DHdycG9VHhSCZZkxKSFwgQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fplanka.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/planka.service 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/planka.service 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "637db51a-1b52-45c7-abcb-df4332f99c03" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/redlib.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "195" -> (known after apply)
      ~ content_md5                = "3GUaxW21h3nYYUCgZAsQJA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fredlib.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/redlib.path 2026-02-02 00:04:08.62230744 +0000 UTC" -> "./../os-config/systemd/redlib.path 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "42ad9890-f6ef-459f-ab38-c7339df3242f" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/redlib.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "347" -> (known after apply)
      ~ content_md5                = "uFZzmQd+5jUQ7RUTIUeXUQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fredlib.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/redlib.service 2026-02-02 00:04:08.623307429 +0000 UTC" -> "./../os-config/systemd/redlib.service 2026-02-02 00:05:29.079678811 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "34be3faa-bc02-4740-8c5f-390ab27f8e90" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/traefik-config/traefik.yml"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "236" -> (known after apply)
      ~ content_md5                = "CD3FZoMyQ+KlqQKelCO21Q==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Ftraefik-config%2Ftraefik.yml" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/traefik-config/traefik.yml 2026-02-02 00:04:08.623307429 +0000 UTC" -> "./../os-config/traefik-config/traefik.yml 2026-02-02 00:05:29.0806788 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "ae42bc59-8720-4a35-99b8-7ab78160c052" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 29 to add, 0 to change, 29 to destroy.

```